<?php


use Phinx\Seed\AbstractSeed;

class User extends AbstractSeed
{
    /**
     * Run Method.
     *
     * Write your database seeder using this method.
     *
     * More information on writing seeders is available here:
     * https://book.cakephp.org/phinx/0/en/seeding.html
     */
    public function run(): void
    {
        $sql = "INSERT INTO `user` (`id`, `first_name`, `last_name`, `middle_name`, `data_of_birth`, `created_at`, `update_at`) VALUES
(1, 'Сергей', 'Петров', 'Юрьевич', '1987-09-06', '2023-07-31 17:55:12', '2023-08-01 17:43:32'),
(2, 'Юлия', 'Салагаева', 'Алексеевна', '1997-04-02', '2023-07-17 17:55:12', '2023-08-01 17:43:32'),
(3, 'Петр', 'Аксенов', 'Витальевич', '1985-11-02', '2023-06-30 17:55:12', '2023-08-01 17:43:32'),
(4, 'Анастасия', 'Юнг', 'Витальевна', '1997-02-04', '2023-07-17 17:55:12', '2023-08-01 17:43:32'),
(5, 'Максим', 'Фарахов', 'Витальевич', '1975-10-02', '2023-06-30 17:55:12', '2023-08-01 17:43:32'),
(6, 'Анастасия', 'Абрамовская', 'Алексеевна', '1994-01-01', '2023-07-17 17:55:12', '2023-08-01 17:43:32'),
(7, 'Юрий', 'Максимов', 'Юрьевич', '1989-04-14', '2023-07-31 17:55:12', '2023-08-01 17:43:32'),
(8, 'Алексей', 'Абалаков', 'Юрьевич', '1981-02-25', '2023-07-17 17:55:12', '2023-08-01 17:43:32'),
(9, 'Сергей', 'Юшницкий', 'Артемович', '1988-05-09', '2023-07-31 17:55:12', '2023-08-01 17:43:32'),
(10, 'Александр', 'Каменев', 'Юрьевич', '1979-02-25', '2023-07-17 17:55:12', '2023-08-01 17:43:32');";

        $this->execute($sql);
    }
}
